Revit 2027 API
UnderlayOrientation Enumeration
 Indicates how elements in the underlay are viewed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum UnderlayOrientation
Public Enumeration UnderlayOrientation
public enum class UnderlayOrientation
type UnderlayOrientation
Members
Member name | Value | Description
LookingDown | 0 |  Underlay elements are viewed as if looking down from above.
LookingUp | 1 |  Underlay elements are viewed as if looking up from below.
See Also
Reference
Autodesk.Revit.DB Namespace